     A          R TRGDEFR                   PFILE(TRGDEFPF)
     A
     A          K TDEVNT
     A          K TDTIME
     A          K TDFILE
     A          K TDFLIB
