     A          R TRGDRVXR
     A                                      PFILE(*LIBL/TRGDRVXPF)
     A
     A          K XFILNAM
     A          K XFILLIB
     A          K XPGMNAM
     A          K XPGMLIB
     A          S XSTATUS                   COMP(EQ 'A')
