     A          R TRGDRVR
     A                                      PFILE(*LIBL/TRGDRVPF)
     A
     A          K FILLIB
     A          K FILNAM
     A          K EVENT
