     A          R TRGDRVXR
     A                                      PFILE(*LIBL/TRGDRVXPF)
     A
     A          K XFILLIB
     A          K XFILNAM
     A          K XPGMNAM
     A          K XPGMLIB
