**FREE
Ctl-Opt Main(TESTRPG);



Dcl-Proc TESTRPG;
  Dcl-Pi *N;
  End-Pi;

if 'CAT' = 'DOG';
  dsply 'that''s odd';
else;
  dsply 'that''s normal';
endif;

dsply 'hello Dave';



End-Proc;